zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_AHBSC.h
/*
** ###################################################################
**     Processors:          MCXA286VASR
**                          MCXA286VLL
**                          MCXA286VLQ
**                          MCXA286VPN
**                          MCXA287VASR
**                          MCXA287VLL
**                          MCXA287VLQ
**                          MCXA287VPN
**                          MCXA456VASR
**                          MCXA456VLL
**                          MCXA456VLQ
**                          MCXA456VPN
**                          MCXA457VASR
**                          MCXA457VLL
**                          MCXA457VLQ
**                          MCXA457VPN
**                          MCXA536VLL
**                          MCXA536VLQ
**                          MCXA536VPN
**                          MCXA537VLL
**                          MCXA537VLQ
**                          MCXA537VPN
**                          MCXA556BVPN
**                          MCXA556VPN
**                          MCXA557BVPN
**                          MCXA557VPN
**                          MCXA566VLL
**                          MCXA566VLQ
**                          MCXA566VPN
**                          MCXA567VLL
**                          MCXA567VLQ
**                          MCXA567VPN
**                          MCXA577VLL
**                          MCXA577VLQ
**                          MCXA577VPN
**
**     Version:             rev. 2.0, 2024-10-29
**     Build:               b260708
**
**     Abstract:
**         CMSIS Peripheral Access Layer for AHBSC
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2024-03-26)
**         Initial version based on Rev1 DraftC RM
**     - rev. 2.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_AHBSC.h
 * @version 2.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for AHBSC
 *
 * CMSIS Peripheral Access Layer for AHBSC
 */

#if !defined(PERI_AHBSC_H_)
#define PERI_AHBSC_H_                            /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXA286VASR) || defined(CPU_MCXA286VLL) || defined(CPU_MCXA286VLQ) || defined(CPU_MCXA286VPN))
#include "MCXA286_COMMON.h"
#elif (defined(CPU_MCXA287VASR) || defined(CPU_MCXA287VLL) || defined(CPU_MCXA287VLQ) || defined(CPU_MCXA287VPN))
#include "MCXA287_COMMON.h"
#elif (defined(CPU_MCXA456VASR) || defined(CPU_MCXA456VLL) || defined(CPU_MCXA456VLQ) || defined(CPU_MCXA456VPN))
#include "MCXA456_COMMON.h"
#elif (defined(CPU_MCXA457VASR) || defined(CPU_MCXA457VLL) || defined(CPU_MCXA457VLQ) || defined(CPU_MCXA457VPN))
#include "MCXA457_COMMON.h"
#elif (defined(CPU_MCXA536VLL) || defined(CPU_MCXA536VLQ) || defined(CPU_MCXA536VPN))
#include "MCXA536_COMMON.h"
#elif (defined(CPU_MCXA537VLL) || defined(CPU_MCXA537VLQ) || defined(CPU_MCXA537VPN))
#include "MCXA537_COMMON.h"
#elif (defined(CPU_MCXA556BVPN) || defined(CPU_MCXA556VPN))
#include "MCXA556_COMMON.h"
#elif (defined(CPU_MCXA557BVPN) || defined(CPU_MCXA557VPN))
#include "MCXA557_COMMON.h"
#elif (defined(CPU_MCXA566VLL) || defined(CPU_MCXA566VLQ) || defined(CPU_MCXA566VPN))
#include "MCXA566_COMMON.h"
#elif (defined(CPU_MCXA567VLL) || defined(CPU_MCXA567VLQ) || defined(CPU_MCXA567VPN))
#include "MCXA567_COMMON.h"
#elif (defined(CPU_MCXA577VLL) || defined(CPU_MCXA577VLQ) || defined(CPU_MCXA577VPN))
#include "MCXA577_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- AHBSC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AHBSC_Peripheral_Access_Layer AHBSC Peripheral Access Layer
 * @{
 */

/** AHBSC - Size of Registers Arrays */
#define AHBSC_FLASH00_MEM_RULE_COUNT              4u
#define AHBSC_FLASH01_MEM_RULE_COUNT              4u
#define AHBSC_ROM_MEM_RULE_COUNT                  4u
#define AHBSC_RAMX_MEM_RULE0_COUNT                4u
#define AHBSC_RAMA_MEM_RULE_COUNT                 8u
#define AHBSC_RAMB_MEM_RULE_COUNT                 8u
#define AHBSC_FLEXSPI0_REGION0_MEM_RULE_COUNT     4u
#define AHBSC_FLEXSPI0_REGION1_6_MEM_RULE_COUNT   6u
#define AHBSC_SEC_VIO_ADDRN_COUNT                 8u
#define AHBSC_SEC_VIO_MISC_INFON_COUNT            8u
#define AHBSC_SEC_GP_REG_COUNT                    10u

/** AHBSC - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[16];
  __IO uint32_t FLASH00_MEM_RULE[AHBSC_FLASH00_MEM_RULE_COUNT]; /**< Flash Memory Rule, array offset: 0x10, array step: 0x4 */
  __IO uint32_t FLASH01_MEM_RULE[AHBSC_FLASH01_MEM_RULE_COUNT]; /**< Flash Memory Rule, array offset: 0x20, array step: 0x4 */
  __IO uint32_t FLASH02_MEM_RULE;                  /**< Flash IFR0 Rule register, offset: 0x30 */
       uint8_t RESERVED_1[12];
  __IO uint32_t FLASH03_MEM_RULE;                  /**< Flash Memory Rule, offset: 0x40 */
       uint8_t RESERVED_2[28];
  __IO uint32_t ROM_MEM_RULE[AHBSC_ROM_MEM_RULE_COUNT]; /**< ROM Memory Rule, array offset: 0x60, array step: 0x4 */
       uint8_t RESERVED_3[16];
  __IO uint32_t RAMX_MEM_RULE[AHBSC_RAMX_MEM_RULE0_COUNT]; /**< RAMX Memory Rule, array offset: 0x80, array step: 0x4 */
       uint8_t RESERVED_4[16];
  __IO uint32_t RAMA_MEM_RULE[AHBSC_RAMA_MEM_RULE_COUNT]; /**< RAMA Memory Rule 0, array offset: 0xA0, array step: 0x4 */
       uint8_t RESERVED_5[16];
  __IO uint32_t RAMB_MEM_RULE[AHBSC_RAMB_MEM_RULE_COUNT]; /**< RAMB Memory Rule 0, array offset: 0xD0, array step: 0x4 */
  __IO uint32_t AHB_SLAVE_PORT_P5_SLAVE_RULE0;     /**< AHB Slave Port 5 Rule Register, offset: 0xF0 */
       uint8_t RESERVED_6[12];
  __IO uint32_t APB_PERIPHERAL_GROUP0_MEM_RULE0;   /**< APB Bridge Group 0 Memory Rule Register 0, offset: 0x100 */
  __IO uint32_t APB_PERIPHERAL_GROUP0_MEM_RULE1;   /**< APB Bridge Group 0 Memory Rule Register 1, offset: 0x104 */
       uint8_t RESERVED_7[8];
  __IO uint32_t AIPS_BRIDGE_GROUP0_MEM_RULE0;      /**< AIPS Bridge Group 0 Memory Rule 0, offset: 0x110 */
  __IO uint32_t AIPS_BRIDGE_GROUP0_MEM_RULE1;      /**< AIPS Bridge Group 0 Memory Rule 1, offset: 0x114 */
       uint8_t RESERVED_8[8];
  __IO uint32_t AIPS_BRIDGE_GROUP1_MEM_RULE0;      /**< AIPS Bridge Group 1 Memory Rule 0, offset: 0x120 */
  __IO uint32_t AIPS_BRIDGE_GROUP1_MEM_RULE1;      /**< AIPS Bridge Group 1 Memory Rule 1, offset: 0x124 */
       uint8_t RESERVED_9[8];
  __IO uint32_t AHB_SECURE_CTRL_MEM_RULE0;         /**< AHB Secure Control Peripheral Rule, offset: 0x130 */
       uint8_t RESERVED_10[12];
  __IO uint32_t AHB_PERIPHERAL0_MEM_RULE1;         /**< AHB Peripheral 0 Memory Rule 1, offset: 0x140 */
       uint8_t RESERVED_11[12];
  __IO uint32_t AHB_PERIPHERAL0_MEM_RULE2;         /**< AHB Peripheral 0 Memory Rule 2, offset: 0x150 */
       uint8_t RESERVED_12[12];
  __IO uint32_t AHB_PERIPHERAL0_MEM_RULE3;         /**< AHB Peripheral 0 Memory Rule 3, offset: 0x160 */
       uint8_t RESERVED_13[12];
  __IO uint32_t AHB_PERIPHERAL0_MEM_RULE4;         /**< AHB Peripheral 0 Memory Rule 4, offset: 0x170 */
       uint8_t RESERVED_14[12];
  __IO uint32_t AHB_PERIPHERAL0_MEM_RULE5;         /**< AHB Peripheral 0 Memory Rule 5, offset: 0x180 */
       uint8_t RESERVED_15[28];
  __IO uint32_t AIPS_BRIDGE_GROUP2_MEM_RULE0;      /**< AIPS Bridge Group 2 Rule 0, offset: 0x1A0 */
  __IO uint32_t AIPS_BRIDGE_GROUP2_MEM_RULE1;      /**< AIPS Bridge Group 2 Rule 1, offset: 0x1A4 */
  __IO uint32_t AIPS_BRIDGE_GROUP2_MEM_RULE2;      /**< AIPS Bridge Group 2 Rule 2, offset: 0x1A8 */
  __IO uint32_t AIPS_BRIDGE_GROUP2_MEM_RULE3;      /**< AIPS Bridge Group 2 Rule 3, offset: 0x1AC */
  __IO uint32_t AIPS_BRIDGE_GROUP2_MEM_RULE4;      /**< AIPS Bridge Group 2 Rule 4, offset: 0x1B0 */
  __IO uint32_t AIPS_BRIDGE_GROUP2_MEM_RULE5;      /**< AIPS Bridge Group 2 Rule 5, offset: 0x1B4 */
  __IO uint32_t AIPS_BRIDGE_GROUP2_MEM_RULE6;      /**< AIPS Bridge Group 2 Rule 6, offset: 0x1B8 */
  __IO uint32_t AIPS_BRIDGE_GROUP2_MEM_RULE7;      /**< AIPS Bridge Group 2 Rule 7, offset: 0x1BC */
  __IO uint32_t AIPS_BRIDGE_GROUP2_MEM_RULE8;      /**< AIPS Bridge Group 2 Rule 8, offset: 0x1C0 */
  __IO uint32_t AIPS_BRIDGE_GROUP2_MEM_RULE9;      /**< AIPS Bridge Group 2 Rule 9, offset: 0x1C4 */
  __IO uint32_t AIPS_BRIDGE_GROUP2_MEM_RULE10;     /**< AIPS Bridge Group 2 Rule 10, offset: 0x1C8 */
  __IO uint32_t AIPS_BRIDGE_GROUP2_MEM_RULE11;     /**< AIPS Bridge Group 2 Rule 11, offset: 0x1CC */
  __IO uint32_t AIPS_BRIDGE_GROUP2_MEM_RULE12;     /**< AIPS Bridge Group 2 Rule 12, offset: 0x1D0 */
  __IO uint32_t AIPS_BRIDGE_GROUP2_MEM_RULE13;     /**< AIPS Bridge Group 2 Rule 13, offset: 0x1D4 */
       uint8_t RESERVED_16[24];
  __IO uint32_t FLEXSPI0_REGION0_MEM_RULE[AHBSC_FLEXSPI0_REGION0_MEM_RULE_COUNT]; /**< FLEXSPI0 Region 0 Memory Rule, array offset: 0x1F0, array step: 0x4 */
  struct {                                         /* offset: 0x200, array step: 0x10 */
    __IO uint32_t FLEXSPI0_REGION_MEM_RULE;          /**< FLEXSPI0 Region 1 Memory Rule..FLEXSPI0 Region 6 Memory Rule, array offset: 0x200, array step: 0x10 */
         uint8_t RESERVED_0[12];
  } FLEXSPI0_REGION1_6_MEM_RULE[AHBSC_FLEXSPI0_REGION1_6_MEM_RULE_COUNT];
       uint8_t RESERVED_17[2976];
  __I  uint32_t SEC_VIO_ADDR[AHBSC_SEC_VIO_ADDRN_COUNT]; /**< Security Violation Address, array offset: 0xE00, array step: 0x4 */
       uint8_t RESERVED_18[96];
  __I  uint32_t SEC_VIO_MISC_INFO[AHBSC_SEC_VIO_MISC_INFON_COUNT]; /**< Security Violation Miscellaneous Information at Address, array offset: 0xE80, array step: 0x4 */
       uint8_t RESERVED_19[96];
  __IO uint32_t SEC_VIO_INFO_VALID;                /**< Security Violation Info Validity for Address, offset: 0xF00 */
       uint8_t RESERVED_20[124];
  __IO uint32_t SEC_GP_REG[AHBSC_SEC_GP_REG_COUNT]; /**< Secure general purpose registers, array offset: 0xF80, array step: 0x4 */
       uint8_t RESERVED_21[40];
  __IO uint32_t MASTER_SEC_LEVEL;                  /**< Master Secure Level, offset: 0xFD0 */
  __IO uint32_t MASTER_SEC_ANTI_POL_REG;           /**< Master Secure Level, offset: 0xFD4 */
       uint8_t RESERVED_22[20];
  __IO uint32_t CPU0_LOCK_REG;                     /**< Miscellaneous CPU0 Control Signals, offset: 0xFEC */
       uint8_t RESERVED_23[8];
  __IO uint32_t MISC_CTRL_DP_REG;                  /**< Secure Control Duplicate, offset: 0xFF8 */
  __IO uint32_t MISC_CTRL_REG;                     /**< Secure Control, offset: 0xFFC */
} AHBSC_Type;

/* ----------------------------------------------------------------------------
   -- AHBSC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AHBSC_Register_Masks AHBSC Register Masks
 * @{
 */

/*! @name FLASH00_MEM_RULE - Flash Memory Rule */
/*! @{ */

#define AHBSC_FLASH00_MEM_RULE_RULE0_MASK        (0x3U)
#define AHBSC_FLASH00_MEM_RULE_RULE0_SHIFT       (0U)
/*! RULE0 - Rule 0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_FLASH00_MEM_RULE_RULE0(x)          (((uint32_t)(((uint32_t)(x)) << AHBSC_FLASH00_MEM_RULE_RULE0_SHIFT)) & AHBSC_FLASH00_MEM_RULE_RULE0_MASK)

#define AHBSC_FLASH00_MEM_RULE_RULE1_MASK        (0x30U)
#define AHBSC_FLASH00_MEM_RULE_RULE1_SHIFT       (4U)
/*! RULE1 - Rule 1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_FLASH00_MEM_RULE_RULE1(x)          (((uint32_t)(((uint32_t)(x)) << AHBSC_FLASH00_MEM_RULE_RULE1_SHIFT)) & AHBSC_FLASH00_MEM_RULE_RULE1_MASK)

