zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_AHBSC.h
#define AHBSC_AIPS_BRIDGE_GROUP0_MEM_RULE1_ENET0_1_MASK (0x300000U)
#define AHBSC_AIPS_BRIDGE_GROUP0_MEM_RULE1_ENET0_1_SHIFT (20U)
/*! ENET0_1 - ENET0_1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP0_MEM_RULE1_ENET0_1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP0_MEM_RULE1_ENET0_1_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP0_MEM_RULE1_ENET0_1_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP0_MEM_RULE1_eSPI_MASK (0x30000000U)
#define AHBSC_AIPS_BRIDGE_GROUP0_MEM_RULE1_eSPI_SHIFT (28U)
/*! eSPI - eSPI
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP0_MEM_RULE1_eSPI(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP0_MEM_RULE1_eSPI_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP0_MEM_RULE1_eSPI_MASK)
/*! @} */

/*! @name AIPS_BRIDGE_GROUP1_MEM_RULE0 - AIPS Bridge Group 1 Memory Rule 0 */
/*! @{ */

#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_FLEXSPI0_MASK (0x3U)
#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_FLEXSPI0_SHIFT (0U)
/*! FLEXSPI0 - FLEXSPI0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_FLEXSPI0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_FLEXSPI0_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_FLEXSPI0_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_LPSPI2_MASK (0x30U)
#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_LPSPI2_SHIFT (4U)
/*! LPSPI2 - LPSPI2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_LPSPI2(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_LPSPI2_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_LPSPI2_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_LPSPI3_MASK (0x300U)
#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_LPSPI3_SHIFT (8U)
/*! LPSPI3 - LPSPI3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_LPSPI3(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_LPSPI3_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_LPSPI3_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_LPSPI4_MASK (0x3000U)
#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_LPSPI4_SHIFT (12U)
/*! LPSPI4 - LPSPI4
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_LPSPI4(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_LPSPI4_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_LPSPI4_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_LPSPI5_MASK (0x30000U)
#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_LPSPI5_SHIFT (16U)
/*! LPSPI5 - LPSPI5
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_LPSPI5(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_LPSPI5_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE0_LPSPI5_MASK)
/*! @} */

/*! @name AIPS_BRIDGE_GROUP1_MEM_RULE1 - AIPS Bridge Group 1 Memory Rule 1 */
/*! @{ */

#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE1_SPI_FILETER0_MASK (0x30000U)
#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE1_SPI_FILETER0_SHIFT (16U)
/*! SPI_FILETER0 - SPI_FILETER0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE1_SPI_FILETER0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE1_SPI_FILETER0_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE1_SPI_FILETER0_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE1_T1S0_MASK (0x300000U)
#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE1_T1S0_SHIFT (20U)
/*! T1S0 - 10BASE_T1S0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE1_T1S0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE1_T1S0_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE1_T1S0_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE1_USB1_MASK (0x3000000U)
#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE1_USB1_SHIFT (24U)
/*! USB1 - USB1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE1_USB1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE1_USB1_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE1_USB1_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE1_USB1_PHY_MASK (0x30000000U)
#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE1_USB1_PHY_SHIFT (28U)
/*! USB1_PHY - USB1_PHY
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE1_USB1_PHY(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE1_USB1_PHY_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP1_MEM_RULE1_USB1_PHY_MASK)
/*! @} */

/*! @name AHB_SECURE_CTRL_MEM_RULE0 - AHB Secure Control Peripheral Rule */
/*! @{ */

