zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_AHBSC.h
#define AHBSC_AHB_SECURE_CTRL_MEM_RULE0_RULE0_MASK (0x3U)
#define AHBSC_AHB_SECURE_CTRL_MEM_RULE0_RULE0_SHIFT (0U)
/*! RULE0 - AHBSC
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AHB_SECURE_CTRL_MEM_RULE0_RULE0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AHB_SECURE_CTRL_MEM_RULE0_RULE0_SHIFT)) & AHBSC_AHB_SECURE_CTRL_MEM_RULE0_RULE0_MASK)

#define AHBSC_AHB_SECURE_CTRL_MEM_RULE0_RULE1_MASK (0x30U)
#define AHBSC_AHB_SECURE_CTRL_MEM_RULE0_RULE1_SHIFT (4U)
/*! RULE1 - AHBSC ALIAS0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AHB_SECURE_CTRL_MEM_RULE0_RULE1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AHB_SECURE_CTRL_MEM_RULE0_RULE1_SHIFT)) & AHBSC_AHB_SECURE_CTRL_MEM_RULE0_RULE1_MASK)

#define AHBSC_AHB_SECURE_CTRL_MEM_RULE0_RULE2_MASK (0x300U)
#define AHBSC_AHB_SECURE_CTRL_MEM_RULE0_RULE2_SHIFT (8U)
/*! RULE2 - AHBSC ALIAS1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AHB_SECURE_CTRL_MEM_RULE0_RULE2(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AHB_SECURE_CTRL_MEM_RULE0_RULE2_SHIFT)) & AHBSC_AHB_SECURE_CTRL_MEM_RULE0_RULE2_MASK)

#define AHBSC_AHB_SECURE_CTRL_MEM_RULE0_RULE3_MASK (0x3000U)
#define AHBSC_AHB_SECURE_CTRL_MEM_RULE0_RULE3_SHIFT (12U)
/*! RULE3 - AHBSC ALIAS2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AHB_SECURE_CTRL_MEM_RULE0_RULE3(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AHB_SECURE_CTRL_MEM_RULE0_RULE3_SHIFT)) & AHBSC_AHB_SECURE_CTRL_MEM_RULE0_RULE3_MASK)
/*! @} */

/*! @name AHB_PERIPHERAL0_MEM_RULE1 - AHB Peripheral 0 Memory Rule 1 */
/*! @{ */

#define AHBSC_AHB_PERIPHERAL0_MEM_RULE1_GPIO0_MASK (0x3U)
#define AHBSC_AHB_PERIPHERAL0_MEM_RULE1_GPIO0_SHIFT (0U)
/*! GPIO0 - GPIO0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AHB_PERIPHERAL0_MEM_RULE1_GPIO0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AHB_PERIPHERAL0_MEM_RULE1_GPIO0_SHIFT)) & AHBSC_AHB_PERIPHERAL0_MEM_RULE1_GPIO0_MASK)

#define AHBSC_AHB_PERIPHERAL0_MEM_RULE1_GPIO0_ALIAS_MASK (0x30U)
#define AHBSC_AHB_PERIPHERAL0_MEM_RULE1_GPIO0_ALIAS_SHIFT (4U)
/*! GPIO0_ALIAS - GPIO0 ALIAS
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AHB_PERIPHERAL0_MEM_RULE1_GPIO0_ALIAS(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AHB_PERIPHERAL0_MEM_RULE1_GPIO0_ALIAS_SHIFT)) & AHBSC_AHB_PERIPHERAL0_MEM_RULE1_GPIO0_ALIAS_MASK)
/*! @} */

/*! @name AHB_PERIPHERAL0_MEM_RULE2 - AHB Peripheral 0 Memory Rule 2 */
/*! @{ */

#define AHBSC_AHB_PERIPHERAL0_MEM_RULE2_GPIO1_MASK (0x3U)
#define AHBSC_AHB_PERIPHERAL0_MEM_RULE2_GPIO1_SHIFT (0U)
/*! GPIO1 - GPIO1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AHB_PERIPHERAL0_MEM_RULE2_GPIO1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AHB_PERIPHERAL0_MEM_RULE2_GPIO1_SHIFT)) & AHBSC_AHB_PERIPHERAL0_MEM_RULE2_GPIO1_MASK)

#define AHBSC_AHB_PERIPHERAL0_MEM_RULE2_GPIO1_ALIAS_MASK (0x30U)
#define AHBSC_AHB_PERIPHERAL0_MEM_RULE2_GPIO1_ALIAS_SHIFT (4U)
/*! GPIO1_ALIAS - GPIO1 ALIAS
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AHB_PERIPHERAL0_MEM_RULE2_GPIO1_ALIAS(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AHB_PERIPHERAL0_MEM_RULE2_GPIO1_ALIAS_SHIFT)) & AHBSC_AHB_PERIPHERAL0_MEM_RULE2_GPIO1_ALIAS_MASK)
/*! @} */

/*! @name AHB_PERIPHERAL0_MEM_RULE3 - AHB Peripheral 0 Memory Rule 3 */
/*! @{ */

#define AHBSC_AHB_PERIPHERAL0_MEM_RULE3_GPIO2_MASK (0x3U)
#define AHBSC_AHB_PERIPHERAL0_MEM_RULE3_GPIO2_SHIFT (0U)
/*! GPIO2 - GPIO2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AHB_PERIPHERAL0_MEM_RULE3_GPIO2(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AHB_PERIPHERAL0_MEM_RULE3_GPIO2_SHIFT)) & AHBSC_AHB_PERIPHERAL0_MEM_RULE3_GPIO2_MASK)

#define AHBSC_AHB_PERIPHERAL0_MEM_RULE3_GPIO2_ALIAS_MASK (0x30U)
#define AHBSC_AHB_PERIPHERAL0_MEM_RULE3_GPIO2_ALIAS_SHIFT (4U)
/*! GPIO2_ALIAS - GPIO2 ALIAS
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AHB_PERIPHERAL0_MEM_RULE3_GPIO2_ALIAS(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AHB_PERIPHERAL0_MEM_RULE3_GPIO2_ALIAS_SHIFT)) & AHBSC_AHB_PERIPHERAL0_MEM_RULE3_GPIO2_ALIAS_MASK)
/*! @} */

/*! @name AHB_PERIPHERAL0_MEM_RULE4 - AHB Peripheral 0 Memory Rule 4 */
/*! @{ */

#define AHBSC_AHB_PERIPHERAL0_MEM_RULE4_GPIO3_MASK (0x3U)
#define AHBSC_AHB_PERIPHERAL0_MEM_RULE4_GPIO3_SHIFT (0U)
/*! GPIO3 - GPIO3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AHB_PERIPHERAL0_MEM_RULE4_GPIO3(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AHB_PERIPHERAL0_MEM_RULE4_GPIO3_SHIFT)) & AHBSC_AHB_PERIPHERAL0_MEM_RULE4_GPIO3_MASK)

#define AHBSC_AHB_PERIPHERAL0_MEM_RULE4_GPIO3_ALIAS_MASK (0x30U)
#define AHBSC_AHB_PERIPHERAL0_MEM_RULE4_GPIO3_ALIAS_SHIFT (4U)
/*! GPIO3_ALIAS - GPIO3 ALIAS
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AHB_PERIPHERAL0_MEM_RULE4_GPIO3_ALIAS(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AHB_PERIPHERAL0_MEM_RULE4_GPIO3_ALIAS_SHIFT)) & AHBSC_AHB_PERIPHERAL0_MEM_RULE4_GPIO3_ALIAS_MASK)
/*! @} */

/*! @name AHB_PERIPHERAL0_MEM_RULE5 - AHB Peripheral 0 Memory Rule 5 */
/*! @{ */

#define AHBSC_AHB_PERIPHERAL0_MEM_RULE5_GPIO4_MASK (0x3U)
#define AHBSC_AHB_PERIPHERAL0_MEM_RULE5_GPIO4_SHIFT (0U)
/*! GPIO4 - GPIO4
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AHB_PERIPHERAL0_MEM_RULE5_GPIO4(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AHB_PERIPHERAL0_MEM_RULE5_GPIO4_SHIFT)) & AHBSC_AHB_PERIPHERAL0_MEM_RULE5_GPIO4_MASK)

#define AHBSC_AHB_PERIPHERAL0_MEM_RULE5_GPIO4_ALIAS_MASK (0x30U)
#define AHBSC_AHB_PERIPHERAL0_MEM_RULE5_GPIO4_ALIAS_SHIFT (4U)
/*! GPIO4_ALIAS - GPIO4 ALIAS
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AHB_PERIPHERAL0_MEM_RULE5_GPIO4_ALIAS(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AHB_PERIPHERAL0_MEM_RULE5_GPIO4_ALIAS_SHIFT)) & AHBSC_AHB_PERIPHERAL0_MEM_RULE5_GPIO4_ALIAS_MASK)
/*! @} */

