zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_AHBSC.h
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE1_DMA_0_CH10_MASK (0x3000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE1_DMA_0_CH10_SHIFT (12U)
/*! DMA_0_CH10 - DMA_0_CH10
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE1_DMA_0_CH10(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE1_DMA_0_CH10_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE1_DMA_0_CH10_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE1_DMA_0_CH11_MASK (0x30000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE1_DMA_0_CH11_SHIFT (16U)
/*! DMA_0_CH11 - DMA_0_CH11
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE1_DMA_0_CH11(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE1_DMA_0_CH11_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE1_DMA_0_CH11_MASK)
/*! @} */

/*! @name AIPS_BRIDGE_GROUP2_MEM_RULE2 - AIPS Bridge Group 2 Rule 2 */
/*! @{ */

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_SYSCON_MASK (0x30U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_SYSCON_SHIFT (4U)
/*! SYSCON - SYSCON
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_SYSCON(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_SYSCON_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_SYSCON_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_WUU_MASK (0x300U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_WUU_SHIFT (8U)
/*! WUU - WUU
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_WUU(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_WUU_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_WUU_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_VBAT_MASK (0x3000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_VBAT_SHIFT (12U)
/*! VBAT - VBAT
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_VBAT(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_VBAT_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_VBAT_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_FMC_MASK (0x30000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_FMC_SHIFT (16U)
/*! FMC - FMC
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_FMC(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_FMC_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_FMC_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_FMU_MASK (0x300000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_FMU_SHIFT (20U)
/*! FMU - FMU
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_FMU(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_FMU_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE2_FMU_MASK)
/*! @} */

/*! @name AIPS_BRIDGE_GROUP2_MEM_RULE3 - AIPS Bridge Group 2 Rule 3 */
/*! @{ */

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_FLEXIO_MASK (0x30U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_FLEXIO_SHIFT (4U)
/*! FLEXIO - FLEXIO
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_FLEXIO(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_FLEXIO_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_FLEXIO_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPI2C0_MASK (0x300U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPI2C0_SHIFT (8U)
/*! LPI2C0 - LPI2C0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPI2C0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPI2C0_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPI2C0_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPI2C1_MASK (0x3000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPI2C1_SHIFT (12U)
/*! LPI2C1 - LPI2C1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPI2C1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPI2C1_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPI2C1_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPSPI0_MASK (0x30000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPSPI0_SHIFT (16U)
/*! LPSPI0 - LPSPI0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPSPI0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPSPI0_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPSPI0_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPSPI1_MASK (0x300000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPSPI1_SHIFT (20U)
/*! LPSPI1 - LPSPI1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPSPI1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPSPI1_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPSPI1_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_I3C2_MASK (0x3000000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_I3C2_SHIFT (24U)
/*! I3C2 - I3C2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_I3C2(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_I3C2_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_I3C2_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPUART0_MASK (0x30000000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPUART0_SHIFT (28U)
/*! LPUART0 - LPUART0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPUART0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPUART0_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE3_LPUART0_MASK)
/*! @} */

/*! @name AIPS_BRIDGE_GROUP2_MEM_RULE4 - AIPS Bridge Group 2 Rule 4 */
/*! @{ */

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE4_LPUART1_MASK (0x3U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE4_LPUART1_SHIFT (0U)
/*! LPUART1 - LPUART1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE4_LPUART1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE4_LPUART1_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE4_LPUART1_MASK)

