zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_AHBSC.h
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE4_LPUART2_MASK (0x30U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE4_LPUART2_SHIFT (4U)
/*! LPUART2 - LPUART2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE4_LPUART2(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE4_LPUART2_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE4_LPUART2_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE4_LPUART3_MASK (0x300U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE4_LPUART3_SHIFT (8U)
/*! LPUART3 - LPUART3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE4_LPUART3(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE4_LPUART3_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE4_LPUART3_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE4_LPUART4_MASK (0x3000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE4_LPUART4_SHIFT (12U)
/*! LPUART4 - LPUART4
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE4_LPUART4(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE4_LPUART4_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE4_LPUART4_MASK)
/*! @} */

/*! @name AIPS_BRIDGE_GROUP2_MEM_RULE5 - AIPS Bridge Group 2 Rule 5 */
/*! @{ */

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE5_LPTMR_MASK (0x3000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE5_LPTMR_SHIFT (12U)
/*! LPTMR - LPTMR
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE5_LPTMR(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE5_LPTMR_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE5_LPTMR_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE5_OSTIMER_MASK (0x300000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE5_OSTIMER_SHIFT (20U)
/*! OSTIMER - OSTIMER
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE5_OSTIMER(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE5_OSTIMER_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE5_OSTIMER_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE5_WAKE_TIMER_MASK (0x3000000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE5_WAKE_TIMER_SHIFT (24U)
/*! WAKE_TIMER - WAKE_TIMER
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE5_WAKE_TIMER(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE5_WAKE_TIMER_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE5_WAKE_TIMER_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE5_ADC0_MASK (0x30000000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE5_ADC0_SHIFT (28U)
/*! ADC0 - ADC0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE5_ADC0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE5_ADC0_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE5_ADC0_MASK)
/*! @} */

/*! @name AIPS_BRIDGE_GROUP2_MEM_RULE6 - AIPS Bridge Group 2 Rule 6 */
/*! @{ */

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE6_ADC1_MASK (0x3U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE6_ADC1_SHIFT (0U)
/*! ADC1 - ADC1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE6_ADC1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE6_ADC1_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE6_ADC1_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE6_CMP0_MASK (0x30U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE6_CMP0_SHIFT (4U)
/*! CMP0 - CMP0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE6_CMP0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE6_CMP0_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE6_CMP0_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE6_DAC0_MASK (0x30000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE6_DAC0_SHIFT (16U)
/*! DAC0 - DAC0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE6_DAC0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE6_DAC0_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE6_DAC0_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE6_DAC1_MASK (0x300000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE6_DAC1_SHIFT (20U)
/*! DAC1 - DAC1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE6_DAC1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE6_DAC1_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE6_DAC1_MASK)
/*! @} */

