zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_AHBSC.h
/*! @name AIPS_BRIDGE_GROUP2_MEM_RULE7 - AIPS Bridge Group 2 Rule 7 */
/*! @{ */

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_VREF0_MASK (0x3000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_VREF0_SHIFT (12U)
/*! VREF0 - VREF0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_VREF0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_VREF0_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_VREF0_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_PORT0_MASK (0x30000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_PORT0_SHIFT (16U)
/*! PORT0 - PORT0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_PORT0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_PORT0_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_PORT0_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_PORT1_MASK (0x300000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_PORT1_SHIFT (20U)
/*! PORT1 - PORT1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_PORT1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_PORT1_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_PORT1_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_PORT2_MASK (0x3000000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_PORT2_SHIFT (24U)
/*! PORT2 - PORT2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_PORT2(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_PORT2_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_PORT2_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_PORT3_MASK (0x30000000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_PORT3_SHIFT (28U)
/*! PORT3 - PORT3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_PORT3(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_PORT3_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE7_PORT3_MASK)
/*! @} */

/*! @name AIPS_BRIDGE_GROUP2_MEM_RULE8 - AIPS Bridge Group 2 Rule 8 */
/*! @{ */

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_PORT4_MASK (0x3U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_PORT4_SHIFT (0U)
/*! PORT4 - PORT4
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_PORT4(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_PORT4_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_PORT4_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_TSI0_MASK (0x3000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_TSI0_SHIFT (12U)
/*! TSI0 - TSI0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_TSI0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_TSI0_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_TSI0_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_AOI0_MASK (0x30000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_AOI0_SHIFT (16U)
/*! AOI0 - AOI0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_AOI0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_AOI0_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_AOI0_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_CRC0_MASK (0x300000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_CRC0_SHIFT (20U)
/*! CRC0 - CRC0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_CRC0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_CRC0_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_CRC0_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_CMC_MASK (0x3000000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_CMC_SHIFT (24U)
/*! CMC - CMC
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_CMC(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_CMC_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_CMC_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_EIM_MASK (0x30000000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_EIM_SHIFT (28U)
/*! EIM - EIM
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_EIM(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_EIM_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE8_EIM_MASK)
/*! @} */

