zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_AHBSC.h
/*! @name AIPS_BRIDGE_GROUP2_MEM_RULE9 - AIPS Bridge Group 2 Rule 9 */
/*! @{ */

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_ERM_MASK (0x3U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_ERM_SHIFT (0U)
/*! ERM - ERM
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_ERM(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_ERM_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_ERM_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_MBC_MASK (0x30U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_MBC_SHIFT (4U)
/*! MBC - MBC
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_MBC(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_MBC_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_MBC_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_SCG_MASK (0x300U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_SCG_SHIFT (8U)
/*! SCG - SCG
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_SCG(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_SCG_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_SCG_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_SPC_MASK (0x3000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_SPC_SHIFT (12U)
/*! SPC - SPC
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_SPC(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_SPC_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_SPC_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_CAN0_REGION0_MASK (0x30000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_CAN0_REGION0_SHIFT (16U)
/*! CAN0_REGION0 - CAN0 Region 0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_CAN0_REGION0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_CAN0_REGION0_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_CAN0_REGION0_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_CAN0_REGION1_MASK (0x300000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_CAN0_REGION1_SHIFT (20U)
/*! CAN0_REGION1 - CAN0 Region 1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_CAN0_REGION1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_CAN0_REGION1_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_CAN0_REGION1_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_CAN0_REGION2_MASK (0x3000000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_CAN0_REGION2_SHIFT (24U)
/*! CAN0_REGION2 - CAN0 Region 2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_CAN0_REGION2(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_CAN0_REGION2_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_CAN0_REGION2_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_CAN0_REGION3_MASK (0x30000000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_CAN0_REGION3_SHIFT (28U)
/*! CAN0_REGION3 - CAN0 Region 3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_CAN0_REGION3(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_CAN0_REGION3_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE9_CAN0_REGION3_MASK)
/*! @} */

/*! @name AIPS_BRIDGE_GROUP2_MEM_RULE10 - AIPS Bridge Group 2 Rule 10 */
/*! @{ */

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_CAN1_REGION0_MASK (0x3U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_CAN1_REGION0_SHIFT (0U)
/*! CAN1_REGION0 - CAN1 Region 0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_CAN1_REGION0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_CAN1_REGION0_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_CAN1_REGION0_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_CAN1_REGION1_MASK (0x30U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_CAN1_REGION1_SHIFT (4U)
/*! CAN1_REGION1 - CAN1 Region 1
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_CAN1_REGION1(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_CAN1_REGION1_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_CAN1_REGION1_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_CAN1_REGION2_MASK (0x300U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_CAN1_REGION2_SHIFT (8U)
/*! CAN1_REGION2 - CAN1 Region 2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_CAN1_REGION2(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_CAN1_REGION2_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_CAN1_REGION2_MASK)

