zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_AHBSC.h
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_CAN1_REGION3_MASK (0x3000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_CAN1_REGION3_SHIFT (12U)
/*! CAN1_REGION3 - CAN1 Region 3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_CAN1_REGION3(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_CAN1_REGION3_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_CAN1_REGION3_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_LPI2C2_MASK (0x30000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_LPI2C2_SHIFT (16U)
/*! LPI2C2 - LPI2C2
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_LPI2C2(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_LPI2C2_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_LPI2C2_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_LPI2C3_MASK (0x300000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_LPI2C3_SHIFT (20U)
/*! LPI2C3 - LPI2C3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_LPI2C3(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_LPI2C3_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_LPI2C3_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_LPI2C4_MASK (0x3000000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_LPI2C4_SHIFT (24U)
/*! LPI2C4 - LPI2C4
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_LPI2C4(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_LPI2C4_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE10_LPI2C4_MASK)
/*! @} */

/*! @name AIPS_BRIDGE_GROUP2_MEM_RULE11 - AIPS Bridge Group 2 Rule 11 */
/*! @{ */

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE11_LPUART5_MASK (0x300U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE11_LPUART5_SHIFT (8U)
/*! LPUART5 - LPUART5
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE11_LPUART5(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE11_LPUART5_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE11_LPUART5_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE11_I3C3_MASK (0x3000000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE11_I3C3_SHIFT (24U)
/*! I3C3 - I3C3
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE11_I3C3(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE11_I3C3_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE11_I3C3_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE11_GPIO5_MASK (0x30000000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE11_GPIO5_SHIFT (28U)
/*! GPIO5 - GPIO5
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE11_GPIO5(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE11_GPIO5_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE11_GPIO5_MASK)
/*! @} */

/*! @name AIPS_BRIDGE_GROUP2_MEM_RULE12 - AIPS Bridge Group 2 Rule 12 */
/*! @{ */

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE12_GPIO5_ALIAS_MASK (0x3U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE12_GPIO5_ALIAS_SHIFT (0U)
/*! GPIO5_ALIAS - GPIO5_ALIAS
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE12_GPIO5_ALIAS(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE12_GPIO5_ALIAS_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE12_GPIO5_ALIAS_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE12_PORT5_MASK (0x3000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE12_PORT5_SHIFT (12U)
/*! PORT5 - PORT5
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE12_PORT5(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE12_PORT5_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE12_PORT5_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE12_DGDET0_MASK (0x300000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE12_DGDET0_SHIFT (20U)
/*! DGDET0 - DGDET0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE12_DGDET0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE12_DGDET0_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE12_DGDET0_MASK)

#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE12_ITRC0_MASK (0x30000000U)
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE12_ITRC0_SHIFT (28U)
/*! ITRC0 - ITRC0
 *  0b00..Non-secure and non-privilege user access allowed
 *  0b01..Non-secure and privilege access allowed
 *  0b10..Secure and non-privilege user access allowed
 *  0b11..Secure and privilege user access allowed
 */
#define AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE12_ITRC0(x) (((uint32_t)(((uint32_t)(x)) << AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE12_ITRC0_SHIFT)) & AHBSC_AIPS_BRIDGE_GROUP2_MEM_RULE12_ITRC0_MASK)
/*! @} */

/*! @name AIPS_BRIDGE_GROUP2_MEM_RULE13 - AIPS Bridge Group 2 Rule 13 */
/*! @{ */

