zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_AHBSC.h
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_0_MASK     (0x1U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_0_SHIFT    (0U)
/*! DMA1_IPD_REQ_0 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_0(x)       (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_0_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_0_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_1_MASK     (0x2U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_1_SHIFT    (1U)
/*! DMA0_IPD_REQ_1 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_1(x)       (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_1_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_1_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_1_MASK     (0x2U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_1_SHIFT    (1U)
/*! DMA1_IPD_REQ_1 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_1(x)       (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_1_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_1_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_2_MASK     (0x4U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_2_SHIFT    (2U)
/*! DMA0_IPD_REQ_2 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_2(x)       (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_2_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_2_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_2_MASK     (0x4U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_2_SHIFT    (2U)
/*! DMA1_IPD_REQ_2 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_2(x)       (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_2_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_2_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_3_MASK     (0x8U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_3_SHIFT    (3U)
/*! DMA0_IPD_REQ_3 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_3(x)       (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_3_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_3_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_3_MASK     (0x8U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_3_SHIFT    (3U)
/*! DMA1_IPD_REQ_3 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_3(x)       (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_3_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_3_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_4_MASK     (0x10U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_4_SHIFT    (4U)
/*! DMA0_IPD_REQ_4 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_4(x)       (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_4_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_4_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_4_MASK     (0x10U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_4_SHIFT    (4U)
/*! DMA1_IPD_REQ_4 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_4(x)       (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_4_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_4_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_5_MASK     (0x20U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_5_SHIFT    (5U)
/*! DMA0_IPD_REQ_5 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_5(x)       (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_5_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_5_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_5_MASK     (0x20U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_5_SHIFT    (5U)
/*! DMA1_IPD_REQ_5 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_5(x)       (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_5_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_5_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_6_MASK     (0x40U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_6_SHIFT    (6U)
/*! DMA0_IPD_REQ_6 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_6(x)       (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_6_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_6_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_6_MASK     (0x40U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_6_SHIFT    (6U)
/*! DMA1_IPD_REQ_6 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_6(x)       (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_6_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_6_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_7_MASK     (0x80U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_7_SHIFT    (7U)
/*! DMA0_IPD_REQ_7 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_7(x)       (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_7_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_7_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_7_MASK     (0x80U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_7_SHIFT    (7U)
/*! DMA1_IPD_REQ_7 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_7(x)       (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_7_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_7_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_8_MASK     (0x100U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_8_SHIFT    (8U)
/*! DMA0_IPD_REQ_8 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_8(x)       (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_8_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_8_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_8_MASK     (0x100U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_8_SHIFT    (8U)
/*! DMA1_IPD_REQ_8 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_8(x)       (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_8_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_8_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_9_MASK     (0x200U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_9_SHIFT    (9U)
/*! DMA0_IPD_REQ_9 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_9(x)       (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_9_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_9_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_9_MASK     (0x200U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_9_SHIFT    (9U)
/*! DMA1_IPD_REQ_9 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_9(x)       (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_9_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_9_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_10_MASK    (0x400U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_10_SHIFT   (10U)
/*! DMA0_IPD_REQ_10 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_10(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_10_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_10_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_10_MASK    (0x400U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_10_SHIFT   (10U)
/*! DMA1_IPD_REQ_10 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_10(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_10_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_10_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_11_MASK    (0x800U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_11_SHIFT   (11U)
/*! DMA0_IPD_REQ_11 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_11(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_11_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_11_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_11_MASK    (0x800U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_11_SHIFT   (11U)
/*! DMA1_IPD_REQ_11 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_11(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_11_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_11_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_12_MASK    (0x1000U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_12_SHIFT   (12U)
/*! DMA0_IPD_REQ_12 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_12(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_12_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_12_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_12_MASK    (0x1000U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_12_SHIFT   (12U)
/*! DMA1_IPD_REQ_12 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_12(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_12_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_12_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_13_MASK    (0x2000U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_13_SHIFT   (13U)
/*! DMA0_IPD_REQ_13 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_13(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_13_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_13_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_13_MASK    (0x2000U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_13_SHIFT   (13U)
/*! DMA1_IPD_REQ_13 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_13(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_13_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_13_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_14_MASK    (0x4000U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_14_SHIFT   (14U)
/*! DMA0_IPD_REQ_14 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_14(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_14_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_14_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_14_MASK    (0x4000U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_14_SHIFT   (14U)
/*! DMA1_IPD_REQ_14 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_14(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_14_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_14_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_15_MASK    (0x8000U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_15_SHIFT   (15U)
/*! DMA0_IPD_REQ_15 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_15(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_15_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_15_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_15_MASK    (0x8000U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_15_SHIFT   (15U)
/*! DMA1_IPD_REQ_15 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_15(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_15_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_15_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_16_MASK    (0x10000U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_16_SHIFT   (16U)
/*! DMA0_IPD_REQ_16 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_16(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_16_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_16_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_16_MASK    (0x10000U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_16_SHIFT   (16U)
/*! DMA1_IPD_REQ_16 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_16(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_16_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_16_MASK)

