zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_AHBSC.h
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_17_MASK    (0x20000U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_17_SHIFT   (17U)
/*! DMA0_IPD_REQ_17 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_17(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_17_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_17_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_17_MASK    (0x20000U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_17_SHIFT   (17U)
/*! DMA1_IPD_REQ_17 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_17(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_17_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_17_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_18_MASK    (0x40000U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_18_SHIFT   (18U)
/*! DMA0_IPD_REQ_18 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_18(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_18_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_18_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_18_MASK    (0x40000U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_18_SHIFT   (18U)
/*! DMA1_IPD_REQ_18 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_18(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_18_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_18_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_19_MASK    (0x80000U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_19_SHIFT   (19U)
/*! DMA0_IPD_REQ_19 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_19(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_19_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_19_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_19_MASK    (0x80000U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_19_SHIFT   (19U)
/*! DMA1_IPD_REQ_19 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_19(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_19_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_19_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_20_MASK    (0x100000U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_20_SHIFT   (20U)
/*! DMA0_IPD_REQ_20 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_20(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_20_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_20_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_20_MASK    (0x100000U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_20_SHIFT   (20U)
/*! DMA1_IPD_REQ_20 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_20(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_20_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_20_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_21_MASK    (0x200000U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_21_SHIFT   (21U)
/*! DMA0_IPD_REQ_21 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_21(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_21_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_21_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_21_MASK    (0x200000U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_21_SHIFT   (21U)
/*! DMA1_IPD_REQ_21 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_21(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_21_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_21_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_22_MASK    (0x400000U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_22_SHIFT   (22U)
/*! DMA0_IPD_REQ_22 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_22(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_22_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_22_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_22_MASK    (0x400000U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_22_SHIFT   (22U)
/*! DMA1_IPD_REQ_22 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_22(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_22_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_22_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_23_MASK    (0x800000U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_23_SHIFT   (23U)
/*! DMA0_IPD_REQ_23 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_23(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_23_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_23_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_23_MASK    (0x800000U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_23_SHIFT   (23U)
/*! DMA1_IPD_REQ_23 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_23(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_23_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_23_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_24_MASK    (0x1000000U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_24_SHIFT   (24U)
/*! DMA0_IPD_REQ_24 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_24(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_24_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_24_MASK)

