zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_AHBSC.h
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_24_MASK    (0x1000000U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_24_SHIFT   (24U)
/*! DMA1_IPD_REQ_24 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_24(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_24_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_24_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_25_MASK    (0x2000000U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_25_SHIFT   (25U)
/*! DMA0_IPD_REQ_25 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_25(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_25_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_25_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_25_MASK    (0x2000000U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_25_SHIFT   (25U)
/*! DMA1_IPD_REQ_25 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_25(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_25_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_25_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_26_MASK    (0x4000000U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_26_SHIFT   (26U)
/*! DMA0_IPD_REQ_26 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_26(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_26_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_26_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_26_MASK    (0x4000000U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_26_SHIFT   (26U)
/*! DMA1_IPD_REQ_26 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_26(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_26_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_26_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_27_MASK    (0x8000000U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_27_SHIFT   (27U)
/*! DMA0_IPD_REQ_27 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_27(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_27_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_27_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_27_MASK    (0x8000000U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_27_SHIFT   (27U)
/*! DMA1_IPD_REQ_27 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_27(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_27_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_27_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_28_MASK    (0x10000000U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_28_SHIFT   (28U)
/*! DMA0_IPD_REQ_28 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_28(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_28_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_28_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_28_MASK    (0x10000000U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_28_SHIFT   (28U)
/*! DMA1_IPD_REQ_28 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_28(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_28_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_28_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_29_MASK    (0x20000000U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_29_SHIFT   (29U)
/*! DMA0_IPD_REQ_29 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_29(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_29_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_29_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_29_MASK    (0x20000000U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_29_SHIFT   (29U)
/*! DMA1_IPD_REQ_29 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_29(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_29_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_29_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_30_MASK    (0x40000000U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_30_SHIFT   (30U)
/*! DMA0_IPD_REQ_30 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_30(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_30_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_30_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_30_MASK    (0x40000000U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_30_SHIFT   (30U)
/*! DMA1_IPD_REQ_30 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_30(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_30_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_30_MASK)

#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_31_MASK    (0x80000000U)
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_31_SHIFT   (31U)
/*! DMA0_IPD_REQ_31 - DMA0 IPD_REQ
 *  0b0..Indicates that DMA0 is masked for IPD_REQ
 *  0b1..Indicates that DMA0 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA0_IPD_REQ_31(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA0_IPD_REQ_31_SHIFT)) & AHBSC_SEC_GP_REG_DMA0_IPD_REQ_31_MASK)

#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_31_MASK    (0x80000000U)
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_31_SHIFT   (31U)
/*! DMA1_IPD_REQ_31 - DMA1 IPD_REQ
 *  0b0..Indicates that DMA1 is masked for IPD_REQ
 *  0b1..Indicates that DMA1 is enabled for IPD_REQ
 */
#define AHBSC_SEC_GP_REG_DMA1_IPD_REQ_31(x)      (((uint32_t)(((uint32_t)(x)) << AHBSC_SEC_GP_REG_DMA1_IPD_REQ_31_SHIFT)) & AHBSC_SEC_GP_REG_DMA1_IPD_REQ_31_MASK)
/*! @} */

/*! @name MASTER_SEC_LEVEL - Master Secure Level */
/*! @{ */

#define AHBSC_MASTER_SEC_LEVEL_SMARTDMA_MASK     (0x30U)
#define AHBSC_MASTER_SEC_LEVEL_SMARTDMA_SHIFT    (4U)
/*! SMARTDMA - SMARTDMA Data
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define AHBSC_MASTER_SEC_LEVEL_SMARTDMA(x)       (((uint32_t)(((uint32_t)(x)) << AHBSC_MASTER_SEC_LEVEL_SMARTDMA_SHIFT)) & AHBSC_MASTER_SEC_LEVEL_SMARTDMA_MASK)

#define AHBSC_MASTER_SEC_LEVEL_DMA0_MASK         (0xC0U)
#define AHBSC_MASTER_SEC_LEVEL_DMA0_SHIFT        (6U)
/*! DMA0 - eDMA0
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define AHBSC_MASTER_SEC_LEVEL_DMA0(x)           (((uint32_t)(((uint32_t)(x)) << AHBSC_MASTER_SEC_LEVEL_DMA0_SHIFT)) & AHBSC_MASTER_SEC_LEVEL_DMA0_MASK)

#define AHBSC_MASTER_SEC_LEVEL_DMA1_MASK         (0x300U)
#define AHBSC_MASTER_SEC_LEVEL_DMA1_SHIFT        (8U)
/*! DMA1 - eDMA1
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define AHBSC_MASTER_SEC_LEVEL_DMA1(x)           (((uint32_t)(((uint32_t)(x)) << AHBSC_MASTER_SEC_LEVEL_DMA1_SHIFT)) & AHBSC_MASTER_SEC_LEVEL_DMA1_MASK)

#define AHBSC_MASTER_SEC_LEVEL_PKC_MASK          (0xC00U)
#define AHBSC_MASTER_SEC_LEVEL_PKC_SHIFT         (10U)
/*! PKC - PKC
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define AHBSC_MASTER_SEC_LEVEL_PKC(x)            (((uint32_t)(((uint32_t)(x)) << AHBSC_MASTER_SEC_LEVEL_PKC_SHIFT)) & AHBSC_MASTER_SEC_LEVEL_PKC_MASK)

#define AHBSC_MASTER_SEC_LEVEL_ENET0_MASK        (0x3000000U)
#define AHBSC_MASTER_SEC_LEVEL_ENET0_SHIFT       (24U)
/*! ENET0 - ENET0
 *  0b00..Non-secure and non-privileged Master
 *  0b01..Non-secure and privileged Master
 *  0b10..Secure and non-privileged Master
 *  0b11..Secure and privileged Master
 */
#define AHBSC_MASTER_SEC_LEVEL_ENET0(x)          (((uint32_t)(((uint32_t)(x)) << AHBSC_MASTER_SEC_LEVEL_ENET0_SHIFT)) & AHBSC_MASTER_SEC_LEVEL_ENET0_MASK)

